/* Size Text: GB with precision */
"%0.1f GB" = "%0.1f GB";

/* Size Text: KB with precision */
"%0.1f KB" = "%0.1f Kt";

/* Size Text: MB with precision */
"%0.1f MB" = "%0.1f Mt";

/* <Comma-separated list of names> + <number of hidden names>, e.g. \"Bob, Jane + 3\" */
"%1$@ + %2$ld" = "%1$@ + %2$ld";

/* <Name> shared at <time> */
"%1$@ shared at %2$@" = "%1$@ jaettu klo %2$@";

/* <Name> shared on <date> */
"%1$@ shared on %2$@" = "%1$@ jaettu %2$@";

/* No comment provided by engineer. */
"%@ shared {NOTEBOOKS_PLURAL:a notebook|{NOTEBOOKS} notebooks}" = "%@ jakoi {NOTEBOOKS_PLURAL:muistikirjan|{NOTEBOOKS} muistikirjaa}";

/* No comment provided by engineer. */
"%@ shared {NOTES_PLURAL:a note|{NOTES} notes}" = "%@ jakoi {NOTES_PLURAL:muistiinpanon|{NOTES} muistiinpanoa}";

/* No comment provided by engineer. */
"%@ shared {NOTES_PLURAL:{NOTES} note|{NOTES} notes} and {NOTEBOOKS_PLURAL:{NOTEBOOKS} notebook|{NOTEBOOKS} notebooks}" = "%@ jakoi {NOTES_PLURAL:{NOTES} muistiinpanon|{NOTES} muistiinpanoa} ja {NOTEBOOKS_PLURAL:{NOTEBOOKS} muistikirjan|{NOTEBOOKS} muistikirjaa}";

/* %d Notebooks */
"%d Notebooks" = "%d muistikirjaa";

/* %d Notes */
"%d Notes" = "%d muistiinpanoa";

/* Chat title when all participants are unknown. The parameter is the number of participants */
"%d other people" = "%d muuta henkilöä";

/* Size Text: bytes */
"%qu bytes" = "%qu tavua";

/* Size Text: GB */
"%qu GB" = "%qu Gt";

/* Size Text: KB */
"%qu KB" = "%qu Kt";

/* Size Text: MB */
"%qu MB" = "%qu Mt";

/* 1 Note */
"1 Note" = "1 muistiinpano";

/* 1 Notebook */
"1 Notebook" = "1 muistikirja";

/* 1 other person was added */
"1 other person was added" = "1 uusi henkilö lisättiin";

/* <changedBy> added 1 other person to <threadName> */
"<changedBy> added 1 other person to <threadName>" = "<changedBy> lisäsi 1 uuden henkilön kohteeseen <threadName>";

/* <changedBy> added 1 other person to this chat */
"<changedBy> added 1 other person to this chat" = "<changedBy> lisäsi 1 uuden henkilön tähän keskusteluun";

/* <changedBy> added <changedParticipant> to <threadName> */
"<changedBy> added <changedParticipant> to <threadName>" = "<changedBy> lisäsi käyttäjän <changedParticipant> kohteeseen <threadName>";

/* <changedBy> added <changedParticipant> to this chat */
"<changedBy> added <changedParticipant> to this chat" = "<changedBy> lisäsi käyttäjän <changedParticipant> tähän keskusteluun";

/* <changedBy> added you to <threadName> */
"<changedBy> added you to <threadName>" = "<changedBy> lisäsi sinut kohteeseen <threadName>";

/* <changedBy> added you to this chat */
"<changedBy> added you to this chat" = "<changedBy> lisäsi sinut tähän keskusteluun";

/* <changedBy> changed the topic */
"<changedBy> changed the topic" = "<changedBy> vaihtoi aiheen";

/* <changedBy> changed the topic from <oldThreadName> to <newThreadName> */
"<changedBy> changed the topic from <oldThreadName> to <newThreadName>" = "<changedBy> vaihtoi aiheen <oldThreadName> aiheeksi <newThreadName>";

/* Someone in a thread included one or more attachments in a chat. Below this string, there is a clickable list of attachment names. */
"<changedBy> included:" = "<changedBy> liitti:";

/* <changedBy> left <threadName> */
"<changedBy> left <threadName>" = "<changedBy> poistui kohteesta <threadName>";

/* <changedBy> left this chat */
"<changedBy> left this chat" = "<changedBy> poistui tästä keskustelusta";

/* <changedBy> removed 1 other person from <threadName> */
"<changedBy> removed 1 other person from <threadName>" = "<changedBy> 1 muu henkilö poistettiin kohteesta <threadName>";

/* <changedBy> removed 1 other person from this chat */
"<changedBy> removed 1 other person from this chat" = "<changedBy> poisti 1 muun henkilön tästä keskustelusta";

/* <changedBy> removed <changedParticipant> from <threadName> */
"<changedBy> removed <changedParticipant> from <threadName>" = "<changedBy> poisti käyttäjän <changedParticipant> kohteesta <threadName>";

/* <changedBy> removed <changedParticipant> from this chat */
"<changedBy> removed <changedParticipant> from this chat" = "<changedBy> poisti käyttäjän <changedParticipant> tästä keskustelusta";

/* <changedBy> removed you from <threadName> */
"<changedBy> removed you from <threadName>" = "<changedBy> poisti sinut kohteesta <threadName>";

/* <changedBy> removed you from this chat */
"<changedBy> removed you from this chat" = "<changedBy> poisti sinut tästä keskustelusta";

/* <changedBy> set the topic */
"<changedBy> set the topic" = "<changedBy> valitsi aiheen";

/* <changedBy> set the topic: <newThreadName> */
"<changedBy> set the topic: <newThreadName>" = "<changedBy> valitsi aiheen: <newThreadName>";

/* <changedBy> unset the topic */
"<changedBy> unset the topic" = "<changedBy> poisti aiheen";

/* <changedParticipant> was added */
"<changedParticipant> was added" = "<changedParticipant> lisättiin";

/* <changedParticipant> was removed */
"<changedParticipant> was removed" = "<changedParticipant> poistettiin";

/* \"%@\" is already in use. Please use a unique topic name. */
"\"%@\" is already in use. Please use a unique topic name." = "\"%@\" on jo käytössä. Käytä ainutkertaista aiheen nimeä.";

/* All other participants have left */
"All other participants have left" = "Kaikki muut osallistujat ovat lähteneet";

/* An Evernote user
   Generic display name when contact name is not known. */
"An Evernote user" = "Evernote-käyttäjä";

/* Failed to reshare attachments when adding participants to chat. */
"Attachments could not be included." = "Liitteitä ei voitu sisällyttää.";

/* Authorization failed. */
"Authorization failed." = "Todennus epäonnistui.";

/* unable to open the note error title, no note title */
"Can't open note" = "Muistiinpanoa ei voida avata";

/* unable to open the noteboook error title, no note title */
"Can't open notebook" = "Muistikirjaa ei voi avata";

/* Conflicting modification by %@ on %@: */
"Conflicting modification by %@ on %@:" = "Risteävä muokkaus henkilöltä %1$@ päivänä %2$@:";

/* Conflicting modification on %@: */
"Conflicting modification on %@:" = "Ristiriitainen muutos %@:";

/* Contacting Evernote server... */
"Contacting Evernote server…" = "Otetaan yhteyttä Evernote-palvelimeen…";

/* Could not sync note '%@'. */
"Could not sync note ‘%@’." = "Muistiinpanoa %@ ei voitu synkronoida.";

/* Deleting items */
"Deleting items" = "Poistetaan kohteita";

/* Deleting notebooks */
"Deleting notebooks" = "Poistetaan muistikirjoja";

/* Deleting notes */
"Deleting notes" = "Poistetaan muistiinpanoja";

/* Deleting resources */
"Deleting resources" = "Poistetaan aineistoja";

/* Deleting saved searchs */
"Deleting saved searchs" = "Poistetaan tallennettuja hakuja";

/* Deleting shared notebooks */
"Deleting shared notebooks" = "Poistetaan jaettuja muistikirjoja";

/* Deleting tags */
"Deleting tags" = "Poistetaan avainsanoja";

/* Downloading <notebook> */
"Downloading %@" = "Ladataan %@";

/* Downloading headers */
"Downloading headers" = "Ladataan otsakkeita";

/* Downloading headers with placeholder for percentage complete */
"Downloading headers (%i%%)" = "Ladataan otsakkeita (%i%%)";

/* Downloading reminders */
"Downloading reminders" = "Ladataan muistutuksia";

/* Downloading shortcuts */
"Downloading shortcuts" = "Pikavalintojen lataaminen";

/* unable to open note, detail message */
"Either you need permission to access or the note was moved." = "Tarvitset joko käyttöoikeuden muistiinpanoon tai muistiinpano on siirretty.";

/* unable to open notebook, detail message */
"Either you need permission to access or the notebook was moved or deleted." = "Tarvitset joko käyttöoikeuden muistikirjaan tai muistikirja on siirretty tai poistettu.";

/* Email error */
"Email error" = "Sähköpostivirhe";

/* Email limit reached error message. */
"Email limit reached." = "Sähköpostiraja saavutettu.";

/* Email permission denied error message. */
"Email permission denied." = "Sähköpostiin pääsy evätty.";

/* Error syncing shared notebook please contact the owner of this notebook to receive a new invitation. */
"Error syncing shared notebook please contact the owner of this notebook to receive a new invitation." = "Virhe jaetun muistikirjan synkronoinnissa – pyydä uusi kutsu muistikirjan omistajalta.";

/* Evernote Basic */
"Evernote Basic" = "Evernote Basic";

/* Evernote Plus */
"Evernote Plus" = "Evernote Plus";

/* Evernote Premium */
"Evernote Premium" = "Evernote Premium";

/* Expired Password */
"Expired password" = "Vanhentunut salasana";

/* Failed to update topic for this chat. */
"Failed to update topic for this chat." = "Tämän keskustelun aiheen päivitys epäonnistui";

/* Finding notes to download... */
"Finding notes to download…" = "Etsitään ladattavia muistiinpanoja…";

/* GenericCommunicationsError */
"GenericCommunicationsError" = "GenericCommunicationsError";

/* Imported notebook name */
"Import %1$@" = "Tuo %1$@";

/* Invalid auth token */
"Invalid auth token" = "Virheellinen todennustunnus";

/* Email rejected error message. */
"Invalid email address." = "Sähköpostiosoite ei kelpaa.";

/* Invalid Password */
"Invalid password" = "Virheellinen salasana";

/* Invalid shared notebook */
"Invalid shared notebook" = "Virheellinen jaettu muistikirja";

/* Invalid username */
"Invalid username" = "Virheellinen käyttäjätunnus";

/* Invalid username or password. */
"Invalid username or password." = "Virheellinen käyttäjätunnus tai salasana.";

/* DATA_REQUIRED Resource.data */
"It contains a resource with no data." = "Sisältää aineistolähteen ilman tietoja.";

/* BAD_DATA_FORMAT Resource.mime */
"It contains an unsupported resource type." = "Sisältää aineistotyypin, jota ei tueta.";

/* BAD_DATA_FORMAT unknown %@ */
"It contains invalid data [%@]." = "Sisältää virheellistä tietoa [%@].";

/* BAD_DATA_FORMAT ResourceAttributes.sourceURL */
"It contains invalid resource data." = "Sisältää virheellistä aineistotietoa.";

/* LIMIT_REACHED Resource.data.size */
"It has a resource that’s too big." = "Sisältää liian suuren aineiston.";

/* LIMIT_REACHED Note.resources */
"It has too many resources." = "Sisältää liian monta aineistoa.";

/* LIMIT_REACHED Note.tagGuids */
"It has too many tags." = "Sisältää liian monta avainsanaa.";

/* Basic Account LIMIT_REACHED Note.size %@ */
"It is too large.  The maximum size for a note in a Basic account, including all of its resources, is %@." = "Liian suuri. Muistiinpanon enimmäiskoko Basic-tilillä (kaikki aineistot mukaan luettuina) on %@.";

/* Plus Account LIMIT_REACHED Note.size %@ */
"It is too large.  The maximum size for a note in a Plus account, including all of its resources, is %@." = "Liian suuri. Muistiinpanon enimmäiskoko Plus-tilillä (kaikki aineistot mukaan luettuina) on %@.";

/* Premium Account LIMIT_REACHED Note.size %@ */
"It is too large.  The maximum size for a note in a Premium account, including all of its resources, is %@." = "Liian suuri. Muistiinpanon enimmäiskoko Premium-tilillä (kaikki aineistot mukaan luettuina) on %@.";

/* Not Found Notebook.guid
   NOT_FOUND LinkedNotebook.guid
   NOT_FOUND Note.guid
   NOT_FOUND SavedSearch.guid
   NOT_FOUND Tag.guid */
"It was not found on the server." = "Sitä ei löytynyt palvelimelta.";

/* PERMISSION_DENIED Note.notebookGuid */
"Its notebook is not yours." = "Sen muistikirja ei ole sinun.";

/* NOT_FOUND Tag.parentGuid */
"Its parent was not found on the server." = "Ylätason elementtiä ei löytynyt palvelimelta.";

/* PERMISSION_DENIED SavedSearch */
"It’s not your search." = "Se ei ole sinun hakusi.";

/* PERMISSION_DENIED Tag */
"It’s not your tag." = "Se ei ole sinun avainsanasi.";

/* LinkedIn */
"LinkedIn" = "LinkedIn";

/* My Notebook */
"My Notebook" = "Muistikirjani";

/* Name must be unique */
"Names must be unique." = "Nimien on oltava ainutkertaisia.";

/* ERROR TITLE: note not found */
"Note not found" = "Muistiinpanoa ei löytynyt";

/* Note sharing */
"Note sharing" = "Muistiinpanojen jakaminen";

/* ERROR TITLE: notebook not found */
"Notebook not found" = "Muistikirjaa ei löytynyt";

/* Processing server changes */
"Processing server changes" = "Käsitellään palvelinmuutoksia";

/* Processing server note changes */
"Processing server note changes" = "Käsitellään palvelinmuistiinpanojen muutoksia";

/* Processing server notebook changes */
"Processing server notebook changes" = "Käsitellään palvelinmuistikirjojen muutoksia";

/* Processing server resource changes */
"Processing server resource changes" = "Käsitellään palvelinaineistojen muutoksia";

/* Processing server saved search changes */
"Processing server saved search changes" = "Käsitellään palvelimelle tallennettujen hakujen muutoksia";

/* Processing server shared notebook changes */
"Processing server shared notebook changes" = "Käsitellään palvelimelle tallennettujen jaettujen muistikirjojen muutoksia";

/* Processing server tag changes */
"Processing server tag changes" = "Käsitellään palvelinavainsanojen muutoksia";

/* Public Notebook */
"Public Notebook" = "Julkinen muistikirja";

/* Sending changes */
"Sending changes" = "Lähetetään muutoksia";

/* Shared at <time> */
"Shared at %@" = "Jaettu klo %@";

/* Shared on <date> */
"Shared on %@" = "Jaettu %@";

/* Some items failed to sync and could not be shared */
"Some items failed to sync and could not be shared." = "Joitain kohteita ei voitu synkronoida eikä jakaa.";

/* Someone added <changedParticipant> to <threadName> */
"Someone added <changedParticipant> to <threadName>" = "Joku lisäsi käyttäjän <changedParticipant> kohteeseen <threadName>";

/* Someone added <changedParticipant> to this chat */
"Someone added <changedParticipant> to this chat" = "Joku lisäsi käyttäjän <changedParticipant> tähän keskusteluun";

/* Someone changed the topic */
"Someone changed the topic" = "Joku vaihtoi aiheen";

/* Someone changed the topic from <oldThreadName> to <newThreadName> */
"Someone changed the topic from <oldThreadName> to <newThreadName>" = "Joku vaihtoi aiheen <oldThreadName> aiheeksi <newThreadName>";

/* Someone included one or more attachments in a chat. Below this string, there is a clickable list of attachment names. */
"Someone included:" = "Joku liitti:";

/* Someone left <threadName> */
"Someone left <threadName>" = "Joku poistui kohteesta <threadName>";

/* Someone left this chat */
"Someone left this chat" = "Joku poistui tästä keskustelusta";

/* Someone removed <changedParticipant> from <threadName> */
"Someone removed <changedParticipant> from <threadName>" = "Joku poisti käyttäjän <changedParticipant> kohteesta <threadName>";

/* Someone removed <changedParticipant> from this chat */
"Someone removed <changedParticipant> from this chat" = "Joku poisti käyttäjän <changedParticipant> tästä keskustelusta";

/* Someone removed you from <threadName> */
"Someone removed you from <threadName>" = "Joku poisti sinut kohteesta <threadName>";

/* Someone removed you from this chat */
"Someone removed you from this chat" = "Joku poisti sinut tästä keskustelusta";

/* Someone set the topic */
"Someone set the topic" = "Joku valitsi aiheen";

/* Someone set the topic: <newThreadName> */
"Someone set the topic: <newThreadName>" = "Joku valitsi aiheen: <newThreadName>";

/* Someone unset the topic */
"Someone unset the topic" = "Joku poisti aiheen";

/* Someone was removed from this chat */
"Someone was removed from this chat" = "Joku poistettiin tästä keskustelusta";

/* Name too long */
"Sorry, names are limited to %d characters in length." = "Valitettavasti nimissä voi olla enintään %d merkkiä.";

/* Name too short, Singular Minimum */
"Sorry, names must be at least %d character in length." = "Nimien on oltava vähintään %d merkin pituisia.";

/* Name too short, Plural Minimum */
"Sorry, names must be at least %d characters in length." = "Valitettavasti nimien on oltava vähintään %d merkin pituisia.";

/* QUOTA_REACHED FREE */
"Sorry, the operation you are attempting to perform would exceed your upload allowance and cannot be completed. Upgrade now to Evernote Premium and immediately get increased monthly uploads, stronger security, priority image recognition, and more." = "Olemme pahoillamme, mutta toiminto, jota yrität suorittaa, ylittäisi siirtorajoituksesi. Päivitä nyt Evernote Premiumiin ja saat heti enemmän siirtoja kuussa, paremman tietoturvan, priorisoidun kuvantunnistuksen ja paljon muuta.";

/* Sync failure recovery suggestion. */
"Synchronization failed because of an error communicating with the Evernote servers.  Please try again later." = "Synkronointi epäonnistui, koska Evernote-palvelimiin ei saatu yhteyttä.  Yritä uudestaan myöhemmin.";

/* Sync auth failure recovery suggestion. */
"Synchronization failed because the provided username or password is incorrect." = "Synkronointi epäonnistui, sillä joko käyttäjätunnus tai salasana oli virheellinen.";

/* Sync Failed */
"Synchronization failed." = "Synkronointi epäonnistui.";

/* LIMIT_REACHED NoteAttribute.* */
"The attribute data is invalid." = "Määritetiedot ovat virheelliset.";

/* BAD_DATA_FORMAT BusinessNotebook.description */
"The business notebook description is invalid." = "Business-muistikirjan kuvaus on virheellinen.";

/* The client preference could not be synced */
"The client preference could not be synced" = "Asiakkaan ensisijaista asetusta ei voitu synkronoida";

/* The client preference '%@' could not be synced. */
"The client preference ‘%@’ could not be synced." = "Asiakkaan ensisijaista asetusta %@ ei voitu synkronoida.";

/* The content could not be loaded */
"The content could not be loaded" = "Sisältöä ei voitu ladata";

/* BAD_DATA_FORMAT Note.content */
"The content is invalid." = "Sisältö on virheellistä.";

/* Email rejected recovery suggestion. */
"The email address ‘%@’ was rejected by the server." = "Palvelin hylkäsi sähköpostiosoitteen %@.";

/* Email limit reached recovery suggestion. */
"The email could not be sent because doing so would exceed the daily email limit for this account." = "Sähköpostia ei voitu lähettää, koska se ylittäisi tämän tunnuksen päivittäisen sähköpostirajoituksen.";

/* Email permission denied recovery suggestion. */
"The email could not be sent because the note specified does not belong to this account." = "Sähköpostia ei voitu lähettää, koska muistiinpano ei kuulu tälle tunnukselle.";

/* BAD_DATA_FORMAT SavedSearch.format */
"The format is invalid." = "Muoto on virheellinen.";

/* DATA_CONFLICT SavedSearch.name */
"The name is already being used by another search." = "Toinen haku käyttää jo tätä nimeä.";

/* DATA_CONFLICT Tag.name */
"The name is already being used by another tag." = "Toinen avainsana käyttää jo tätä nimeä.";

/* DATA_CONFLICT Notebook.name */
"The name is already in use by another notebook." = "Nimi on jo toisen muistikirjan käytössä.";

/* BAD_DATA_FORMAT LinkedNotebook.shareName
   BAD_DATA_FORMAT Notebook.name
   BAD_DATA_FORMAT SavedSearch.name
   BAD_DATA_FORMAT Tag.name */
"The name is invalid." = "Nimi on virheellinen.";

/* ERROR MESG: system error, with param for note title */
"The note '%@' could not be opened because of an error on the Evernote service." = "Muistiinpanoa %@ ei voitu avata Evernote-palvelussa olevan virheen vuoksi.";

/* ERROR MESG: generic error, with param for note title */
"The note '%@' could not be opened.  Please check your Internet connection or try again later." = "Muistiinpanoa %@ ei voitu avata. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: note not found, with param for note title */
"The note '%@' could not be shared because it does not exist on the Evernote service." = "Muistiinpanoa %@ ei voitu jakaa, koska sitä ei ole Evernote-palvelussa.";

/* ERROR MESG: system error, with param for note title */
"The note '%@' could not be shared because of an error on the Evernote service." = "Muistiinpanoa %@ ei voitu jakaa Evernote-palvelussa olevan virheen vuoksi.";

/* ERROR MESG: generic error, with param for note title */
"The note '%@' could not be shared.  Please check your Internet connection or try again later." = "Muistiinpanoa %@ ei voitu jakaa. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: note not found */
"The note could not be found. Please check your Internet connection or try again later." = "Muistiinpanoa ei löytynyt. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: generic error */
"The note could not be opened.  Please check your Internet connection or try again later." = "Muistiinpanoa  ei voitu avata. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: system error, with param for notebook name */
"The notebook '%@' could not be opened because of an error on the Evernote service." = "Muistikirjaa %@ ei voitu avata Evernote-palvelussa olevan virheen vuoksi.";

/* ERROR MESG: generic error, with param for notebook name */
"The notebook '%@' could not be opened.  Please check your Internet connection or try again later." = "Muistikirjaa %@ ei voitu avata. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: system error, with param for notebook name */
"The notebook '%@' could not be shared because of an error on the Evernote service." = "Muistikirjaa %@ ei voitu jakaa Evernote-palvelussa olevan virheen vuoksi.";

/* ERROR MESG: generic error, with param for notebook name */
"The notebook '%@' could not be shared.  Please check your internet connection or try again later." = "Muistikirjaa %@ ei voitu jakaa. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* NOT_FOUND Note.notebookGuid */
"The notebook could not be found on the server." = "Muistikirjaa ei löytynyt palvelimelta.";

/* ERROR MESG: note not found */
"The notebook could not be found. Please check your Internet connection or try again later." = "Muistikirjaa ei löytynyt. Tarkista internet-yhteytesi tai yritä myöhemmin uudelleen.";

/* ERROR MESG: notebook not found */
"The notebook could not be shared because it does not exist on the Evernote service." = "Muistikirjaa ei voitu jakaa, koska sitä ei ole Evernote-palvelussa.";

/* The notebook '%@' could not be synced. */
"The notebook ‘%@’ could not be synced." = "Muistikirjaa %@ ei voitu synkronoida.";

/* QUOTA_REACHED PREMIUM */
"The operation you are attempting to perform would exceed your monthly upload allowance and cannot be completed." = "Tehtävää ei voida suorittaa, sillä se ylittäisi kuukausittaisen siirtorajasi.";

/* The owner of this notebook has canceled your invitation to this notebook. Contact the owner to receive a new invitation. */
"The owner of this notebook has canceled your invitation to this notebook. Contact the owner to receive a new invitation." = "Tämän muistikirjan omistaja on perunut kutsusi tähän muistikirjaan. Ota yhteyttä omistajaan saadaksesi uuden kutsun.";

/* BAD_DATA_FORMAT/DATA_CONFLICT Tag.parentGuid */
"The parent tag is invalid." = "Ylätason avainsana on virheellinen.";

/* The preference name or preference value is in an invalid format. */
"The preference name or preference value is in an invalid format." = "Ensisijainen nimi tai ensisijainen arvo on virheellisessä muodossa.";

/* The preference was empty. */
"The preference was empty." = "Ensisijainen arvo oli tyhjä.";

/* BAD_DATA_FORMAT Publishing.publicDescription */
"The public description is too long." = "Julkinen kuvaus on liian pitkä.";

/* DATA_CONFLICT Publishing.uri */
"The public url is already in use by another notebook." = "Julkinen URL-osoite on jo toisen muistikirjan käytössä.";

/* BAD_DATA_FORMAT Publishing.uri
   DATA_REQUIRED Publishing.uri */
"The public url is invalid." = "Julkinen URL-osoite on virheellinen.";

/* BAD_DATA_FORMAT SavedSearch.query */
"The query is too long." = "Lauseke on liian pitkä.";

/* LIMIT_REACHED ResourceAttribute.* */
"The resource attribute data is invalid." = "Aineiston määritetiedot ovat virheelliset.";

/* The resource '%@' could not be synced. */
"The resource ‘%@’ could not be synced." = "Resurssia %@ ei voitu synkronoida.";

/* The search '%@' could not be synced. */
"The search ‘%@’ could not be synced." = "Hakua %@ ei voitu synkronoida.";

/* The shared notebook '%@' could not be synced. */
"The shared notebook ‘%@’ could not be synced." = "Jaettua muistikirjaa %@ ei voitu synkronoida.";

/* The tag '%@' could not be synced. */
"The tag ‘%@’ could not be synced." = "Avainsanaa %@ ei voitu synkronoida.";

/* BAD_DATA_FORMAT Note.title */
"The title is invalid." = "Otsikko on virheellinen.";

/* LIMIT_REACHED Notebook */
"Too many notebooks." = "Liian monta muistikirjaa.";

/* LIMIT_REACHED Note */
"Too many notes." = "Liikaa muistiinpanoja.";

/* LIMIT_REACHED SavedSearch */
"Too many searches." = "Liian monta hakua.";

/* LIMIT_REACHED Tag */
"Too many tags." = "Liian monta avainsanaa.";

/* Tried to add more preferences than the allowed maximum. */
"Tried to add more preferences than the allowed maximum." = "Yritetty lisätä sallittua useampia ensisijaisia arvoja.";

/* ERROR TITLE: unable to access */
"Unable to access note" = "Muistiinpanoa ei voi käyttää";

/* ERROR TITLE: unable to access */
"Unable to access notebook" = "Muistikirjaa ei voi käyttää";

/* ERROR TITLE: unable to open */
"Unable to open note" = "Muistiinpanoa ei voi avata";

/* ERROR TITLE: unable to open */
"Unable to open notebook" = "Muistikirjaa ei voi avata";

/* PERMISSION_DENIED Note. Moved to personal account */
"Unable to save note “%1$@” in notebook “%2$@”. A copy of this note has been placed in your default notebook." = "Muistiinpanoa ”%1$@” ei voi tallentaa muistikirjaan ”%2$@”. Tästä muistiinpanosta on siirretty kopio oletusmuistikirjaan.";

/* PERMISSION_DENIED Note. Moved to personal account, no notebook. */
"Unable to save note “%1$@”. A copy of this note has been placed in your default notebook." = "Muistiinpanoa %1$@ ei voi tallentaa. Tästä muistiinpanosta on siirretty kopio oletusmuistikirjaan.";

/* Unable to set topic. */
"Unable to set topic." = "Aiheen valinta ei onnistu.";

/* ERROR TITLE: system error
   ERROR TITLE: unable to share */
"Unable to share note" = "Muistiinpanon jakaminen ei onnistu";

/* ERROR TITLE: system error
   ERROR TITLE: unable to share */
"Unable to share notebook" = "Muistikirjaa ei voida jakaa";

/* Unknown Error */
"Unknown Error" = "Tuntematon virhe";

/* Unknown Error nf%1$i */
"Unknown Error nf%1$i" = "Tuntematon virhe nf%1$i";

/* Unknown Error s%1$i */
"Unknown Error s%1$i" = "Tuntematon virhe s%1$i";

/* Unknown Error u%1$i */
"Unknown Error u%1$i" = "Tuntematon virhe u%1$i";

/* Unknown account type */
"Unkown account type" = "Tuntematon tilityyppi";

/* Untitled */
"Untitled" = "Nimetön";

/* Waiting for header synchronization */
"Waiting for header synchronization" = "Odotetaan otsikon synkronointia";

/* Waiting for internet connection */
"Waiting for internet connection" = "Odotetaan internet-yhteyttä";

/* The operation will proceed once a WiFi connection is available */
"Waiting for WiFi" = "Odotetaan langatonta verkkoa";

/* You added 1 other person to <threadName> */
"You added 1 other person to <threadName>" = "Lisäsit 1 uuden henkilön kohteeseen <threadName>";

/* You added 1 other person to this chat */
"You added 1 other person to this chat" = "Lisäsit 1 uuden henkilön tähän keskusteluun";

/* You added <changedParticipant> to <threadName> */
"You added <changedParticipant> to <threadName>" = "Lisäsit käyttäjän <changedParticipant> kohteeseen <threadName>";

/* You added <changedParticipant> to this chat */
"You added <changedParticipant> to this chat" = "Lisäsit käyttäjän <changedParticipant> tähän keskusteluun";

/* You are not connected to the internet. */
"You are not connected to the internet." = "Et ole yhteydessä Internetiin.";

/* You changed the topic */
"You changed the topic" = "Vaihdoit aihetta";

/* You changed the topic from <oldThreadName> to <newThreadName> */
"You changed the topic from <oldThreadName> to <newThreadName>" = "Vaihdoit aiheen <oldThreadName> aiheeksi <newThreadName>";

/* PERMISSION_DENIED authenticationToken */
"You do not have permission to write to this notebook." = "Sinulla ei ole oikeutta kirjoittaa tähän muistikirjaan.";

/* don't have permission to share multiple notebooks */
"You don't have permission to share all of the selected notebooks." = "Sinulla ei ole tarvittavia oikeuksia jakaa kaikkia valittuja muistikirjoja.";

/* don't have permission to share multiple notes and notebooks */
"You don't have permission to share all of the selected notes and notebooks." = "Sinulla ei ole tarvittavia oikeuksia jakaa kaikkia valittuja muistiinpanoja ja muistikirjoja.";

/* don't have permission to share multiple notes */
"You don't have permission to share all of the selected notes." = "Sinulla ei ole tarvittavia oikeuksia jakaa kaikkia valittuja muistiinpanoja.";

/* don't have permission to share note with param for note title */
"You don't have permission to share the note '%@'" = "Sinulla ei ole tarvittavia oikeuksia jakaa muistiinpanoa %@.";

/* don't have permission to share notebook with param for notebook name */
"You don't have permission to share the notebook '%@'" = "Sinulla ei ole tarvittavia oikeuksia jakaa muistikirjaa %@.";

/* You included one or more attachments in a chat. Below this string, there is a clickable list of attachment names. */
"You included:" = "Sisällytit:";

/* You left <threadName> */
"You left <threadName>" = "Poistuit kohteesta <threadName>";

/* You left this chat */
"You left this chat" = "Poistuit tästä keskustelusta";

/* ERROR MESG: need business authentication, with param for note title */
"You must authenticate to your business account to open the note '%@'." = "Sinun on todentauduttava Business-tilillesi avataksesi muistiinpanon '%@'.";

/* ERROR MESG: need business authentication, with param for notebook name */
"You must authenticate to your business account to open the notebook '%@'." = "Sinun on todentauduttava Business-tilillesi avataksesi muistikirjan '%@'.";

/* You must be online to access shared notes, error title */
"You must be online to access shared notes." = "Sinun pitää olla online-tilassa käyttääksesi jaettuja muistiinpanoja.";

/* You must be online to access the shared notebook, error title */
"You must be online to access the shared notebook '%@'." = "Sinun pitää olla online-tilassa, jos haluat käyttää jaettua muistikirjaa %@.";

/* You need a network connection to view all available business notebooks. */
"You need a network connection to view all available business notebooks." = "Tarvitset verkkoyhteyden voidaksesi tarkastella kaikkia käytettävissä olevia business-muistikirjoja.";

/* You removed 1 other person from <threadName> */
"You removed 1 other person from <threadName>" = "Poistit 1 muun henkilön kohteesta <threadName>";

/* You removed 1 other person from this chat */
"You removed 1 other person from this chat" = "Poistit 1 toisen henkilön tästä keskustelusta";

/* You removed <changedParticipant> from <threadName> */
"You removed <changedParticipant> from <threadName>" = "Poistit käyttäjän <changedParticipant> kohteesta <threadName>";

/* You removed <changedParticipant> from this chat */
"You removed <changedParticipant> from this chat" = "Poistit käyttäjän <changedParticipant> tästä keskustelusta";

/* You set the topic */
"You set the topic" = "Valitsit aiheen";

/* You set the topic: <newThreadName> */
"You set the topic: <newThreadName>" = "Valitsit aiheen: <newThreadName>";

/* You shared at <time>. */
"You shared at %@" = "Jaoit klo %@";

/* You shared on <date>. */
"You shared on %@" = "Jaoit %@";

/* No comment provided by engineer. */
"You shared {NOTEBOOKS_PLURAL:a notebook|{NOTEBOOKS} notebooks}" = "Jaoit {NOTEBOOKS_PLURAL:muistikirjan|{NOTEBOOKS} muistikirjaa}";

/* No comment provided by engineer. */
"You shared {NOTES_PLURAL:a note|{NOTES} notes}" = "Jaoit {NOTES_PLURAL:muistiinpanon|{NOTES} muistiinpanoa}";

/* No comment provided by engineer. */
"You shared {NOTES_PLURAL:{NOTES} note|{NOTES} notes} and {NOTEBOOKS_PLURAL:{NOTEBOOKS} notebook|{NOTEBOOKS} notebooks}" = "Jaoit {NOTES_PLURAL:{NOTES} muistiinpanon|{NOTES} muistiinpanoa} ja {NOTEBOOKS_PLURAL:{NOTEBOOKS} muistikirjan|{NOTEBOOKS} muistikirjaa}";

/* You unset the topic */
"You unset the topic" = "Poistit aiheen";

/* You were added to this chat */
"You were added to this chat" = "Sinut lisättiin tähän keskusteluun";

/* You were removed from this chat */
"You were removed from this chat" = "Sinut poistettiin tästä keskustelusta";

/* Thread title with only the signed-in user */
"You##threadTitleWithOnlyTheSignedInUser" = "Sinä";

/* Your account has been deactivated. */
"Your account has been deactivated." = "Tilisi aktivointi on poistettu.";

/* Your password has expired. Reset your password to download content. */
"Your password has expired. Reset your password to download content." = "Salasanasi on vanhentunut. Palauta salasanasi ladataksesi sisältöä.";

/* Your password is invalid. Reset your password to download content. */
"Your password is invalid. Reset your password to download content." = "Salasanasi on virheellinen. Palauta salasanasi ladataksesi sisältöä.";

/* Your username is invalid. */
"Your username is invalid." = "Käyttäjätunnuksesi on virheellinen.";
